import { Testimonial } from '../Components/Testimonial';
import wdimg from '../assets/web-1.jpg';
import Slider from 'react-slick';
import { motion } from 'framer-motion';

export const AboutUs = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      className='about-us container'
    >
      <div className='section' style={{ width: '70%' }}>
        <h1 className='title' style={{ color: '#ff1e1e', fontSize: 45 }}>
          আমাদের সম্পর্কে
        </h1>
        <p>
          বর্ণ আইটি ইনস্টিটিউট, আইটিতে সাফল্য সৃষ্টির লক্ষ্যে প্রতিষ্ঠিত একটি
          বিশ্বস্ত প্রতিষ্ঠান। প্রতিষ্ঠা লগ্ন থেকে শুরু করে এখন পর্যন্ত সুদীর্ঘ
          ৫ বছরে বর্ণ আইটি অর্জন করেছে বহুমুখী সাফল্য। অবদান রেখে চলেছে ডিজিটাল
          বাংলাদেশ বিনির্মাণে। বাংলাদেশের অন্যতম প্রধান আইটি প্রতিষ্ঠানটি ২০১৭
          সাল থেকে বেকার সমস্যা দূর করতেও গুরুত্বপূর্ণ ভূমিকা পালন করে আসছে।
        </p>
        <h1 className='title' style={{ marginTop: 40 }}>
          আমাদের মাইলফলক
        </h1>
        <p>
          দীর্ঘ ৫ বছর ধরে কর্মসংস্থান সৃষ্টি সহ দেশের সব শ্রেণি-পেশার মানুষকে
          মানসম্মত তথ্যপ্রযুক্তির প্রশিক্ষণ প্রদানের পাশাপাশি ৫ হাজারেরও বেশি
          মানুষকে সফলভাবে আইটি প্রশিক্ষণ প্রদান করেছে ক্রিয়েটিভ আইটি ইনস্টিটিউট।
          তারই স্বীকৃতি স্বরূপ প্রতিষ্ঠানের সম্মানিত প্রতিষ্ঠাতা ও সিইও মনির
          হোসেনের অর্জনের আলোকিত কিছু মুহূর্ত।
        </p>
      </div>
      <Testimonial
        subtitle='সাফল্যের ৫ বছরের'
        title='আইটি এক্সপার্ট তৈরির
জগতে বিশ্বস্ত প্রতিষ্ঠান'
        className='testimonial p-5 graphics'
        desc='আধুনিক প্রযুক্তির সাথে তাল মিলিয়ে নিজেকে আপডেটেড রাখতে আপনার পাশে রয়েছে বর্ণ আইটি ইন্সটিটিউট। আইটি সেক্টর হোক বা নন-আইটি সেক্টর, সবখানেই এখন আইটি এক্সপার্টদের ভালো চাহিদা রয়েছে। এজন্যই আপডেটেড কারিকুলাম, অভিজ্ঞ মেন্টর আর আধুনিক ল্যাব নিয়ে দীর্ঘ ১৩ বছর যাবত আমরা তৈরি করে চলেছি আইটি এক্সপার্ট। এর ধারাবাহিকতায় আমরা পেয়েছি ৫০ হাজারেরও বেশি সফল মুখ, যারা নিজেরা স্বাবলম্বী হয়ে কর্মসংস্থান তৈরি করেছেন আরও মানুষের। আর এই শিক্ষার্থীদের সাফল্য আমাদের পথচলার অনুপ্রেরণা। আমরা বিশ্বাস করি প্রতিটি মানুষই প্রতিভাবান, আর আপনার প্রতিভা বিকাশের দায়িত্ব আমাদের। প্রয়োজন কেবল আপনার আগ্রহ এবং নিয়মিত অনুশীলনের।'
        img={wdimg}
      />

      <h1>অফিস এবং প্রশিক্ষণের স্থান</h1>
      <div className='container__mobile'>
        <Slider
          {...{
            slidesToShow: 1,
            slidesToScroll: 1
          }}
        >
          <img src={wdimg} alt='' />
          <img src={wdimg} alt='' />
        </Slider>
      </div>
    </motion.div>
  );
};
